{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "trainable": true, "implementation": 1, "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "recurrent_constraint": null, "activation": "tanh", "dropout": 0.0, "name": "lstm_1", "stateful": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "batch_input_shape": [null, 210, 1], "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 128, "return_state": false, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 210, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}}}], "keras_version": "2.1.2"}